0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>I2C_1</name>
			<version>A</version>
			<description>None</description>
			<groupName>I2C</groupName>
			<baseAddress>0x4000a000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1_IRQn</name>
				<value>33</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BUSYF</name>
							<description>Busy Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A transaction is not currently taking place.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A transaction is currently taking place.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACK</name>
							<description>Acknowledge. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: ACK has not been received. Write: Do not send an ACK.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: ACK received. Write: Send an ACK.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARBLF</name>
							<description>Arbitration Lost Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Arbitration lost error has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Arbitration lost error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACKRQF</name>
							<description>Acknowledge Request Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>ACK has not been requested.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>ACK requested.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STO</name>
							<description>Stop. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A stop is not pending and a stop / repeat start has not been detected. Write: Clear the STO bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Stop or stop / repeat start detected. This bit must be cleared by firmware. Write: Generate a stop.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STA</name>
							<description>Start. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A start is not pending and a repeat start has not been detected. Write: Clear the STA bit. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Start or repeat start detected. This bit must be cleared by firmware. Write: Generate a start or repeat start. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXMDF</name>
							<description>Transmit Mode Flag. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RECEIVE</name>
									<description>Module is in receiver mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Module is in transmitter mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSMDF</name>
							<description>Master/Slave Mode Flag. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>Module is operating in Slave mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER</name>
									<description>Module is operating in Master mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STOI</name>
							<description>Stop Interrupt Flag. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A stop interrupt has not occurred. Write: Clear the stop interrupt flag (STOI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Stop interrupt detected. In Slave mode, a stop has been detected on the bus.  In Master mode, a stop has been generated. Write: Force a stop interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACKI</name>
							<description>Acknowledge Interrupt Flag. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: An acknowledge interrupt has not occurred. Write: Clear the acknowledge interrupt (ACKI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: An acknowledge interrupt occurred. Write: Force an acknowledge interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXI</name>
							<description>Receive Done Interrupt Flag. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A receive done interrupt has not occurred. Write: Clear the receive done interrupt (RXI). </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Receive done interrupt occurred. Write: Force a receive done interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXI</name>
							<description>Transmit Done Interrupt Flag. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A transmit done interrupt has not occurred. Write: Clear the transmit done interrupt (TXI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Transmit done interrupt detected. If the transmit is forced to abort by a NACK response, the acknowledge interrupt (ACKI) will also be set. Write: Force a transmit done interrupt. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STAI</name>
							<description>Start Interrupt Flag. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: Start interrupt has not occurred. Write: Clear the start interrupt (STAI). </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Start or repeat start interrupt occurred.  In Slave mode, a start or repeat start is detected.  In Master mode, a start or repeat start has been generated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARBLI</name>
							<description>Arbitration Lost Interrupt Flag. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: An arbitration lost interrupt has not occurred. Write: Clear the arbitration lost interrupt (ARBLI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Arbitration lost interrupt detected. Write: Force an arbitration lost interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T0I</name>
							<description>I2C Timer Byte 0 Interrupt Flag. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A I2C Timer Byte 0 interrupt has not occurred. Write: Clear the I2C Timer Byte 0 interrupt (T0I).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: I2C Timer Byte 0 overflow interrupt detected. Write: Force a I2C Timer Byte 0 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T1I</name>
							<description>I2C Timer Byte 1 Interrupt Flag. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: No interrupt occurred. Write: Clear the I2C Timer Byte 1 interrupt (T1I).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: I2C Timer Byte 1 overflow interrupt is detected. Write: Force a I2C Timer Byte 1 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2I</name>
							<description>I2C Timer Byte 2 Interrupt Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A I2C Timer Byte 2 interrupt has not occurred. Write: Clear the I2C Timer Byte 2 interrupt (T2I).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: I2C Timer Byte 2 overflow interrupt detected. Write: Force a I2C Timer Byte 2 interrupt. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3I</name>
							<description>I2C Timer Byte 3 Interrupt Flag. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A I2C Timer Byte 3 interrupt or SCL low timeout has not occurred. Write: Clear the I2C Timer Byte 3 interrupt (T3I).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: I2C Timer Byte 3 overflow or SCL low timeout interrupt detected. Write: Force a I2C Timer Byte 3 interrupt. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXARM</name>
							<description>Receive Arm. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable data and address reception.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the module to perform a receive operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXARM</name>
							<description>Transmit Arm. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable data and address transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the module to perform a transmit operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVAF</name>
							<description>Slave Address Type Flag. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SLAVE_ADDRESS</name>
									<description>Slave address detected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERAL_CALL</name>
									<description>General Call address detected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATXRXEN</name>
							<description>Auto Transmit or Receive Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not automatically switch to transmit or receive mode after a Start.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>If automatic hardware acknowledge mode is enabled (HACKEN = 1), automatically switch to transmit or receive mode after a Start.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FMD</name>
							<description>Filter Mode. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the input filter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the input filter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>I2C Debug Mode. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The I2C module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the I2C module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SMINH</name>
							<description>Slave Mode Inhibit. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Enable Slave modes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Inhibit Slave modes. The module will not respond to a Master on the bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HACKEN</name>
							<description>Auto Acknowledge Enable . </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic hardware acknowledge.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic hardware acknowledge.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVAMD</name>
							<description>Slave Address Mode. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>7BIT</name>
									<description>Slave addresses are 7 bits.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10BIT</name>
									<description>Slave addresses are 10 bits.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LBACKEN</name>
							<description>Last Byte Acknowledge Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>NACK after the last byte is received.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>ACK after the last byte is received.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GCEN</name>
							<description>General Call Address Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable General Call address decoding.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable General Call address decoding.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>Module Soft Reset. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>I2C module is not in soft reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>I2C module is in soft reset and firmware cannot access all bits in the module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CEN</name>
							<description>I2C Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2C module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2C module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
