0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PBCFG_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>PBCFG_0</groupName>
			<baseAddress>0x4002a000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PBEXT0_IRQn</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>PBEXT1_IRQn</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>PMATCH_IRQn</name>
				<value>45</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL0</name>
					<description>Global Port Control 0</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INT0SEL</name>
							<description>External Interrupt 0 Pin Selection. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT0_0</name>
									<description>Select INT0.0 (PB2.0)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_1</name>
									<description>Select INT0.1 (PB2.1)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_2</name>
									<description>Select INT0.2 (PB2.2)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_3</name>
									<description>Select INT0.3 (PB2.3)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_4</name>
									<description>Select INT0.4 (PB2.4)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_5</name>
									<description>Select INT0.5 (PB2.5)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_6</name>
									<description>Select INT0.6 (PB2.6)</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_7</name>
									<description>Select INT0.7 (PB2.7)</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_8</name>
									<description>Select INT0.8 (PB3.3)</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_9</name>
									<description>Select INT0.9 (PB3.4)</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_10</name>
									<description>Select INT0.10 (PB3.5)</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_11</name>
									<description>Select INT0.11 (PB3.6)</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_12</name>
									<description>Select INT0.12 (PB3.7)</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_13</name>
									<description>Select INT0.13 (PB3.8)</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_14</name>
									<description>Select INT0.14 (PB3.9)</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_15</name>
									<description>Select INT0.15 (PB3.10)</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0POL</name>
							<description>External Interrupt 0 Polarity. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A low value or falling edge on the selected pin will cause interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A high value or rising edge on the selected pin will cause interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0MD</name>
							<description>External Interrupt 0 Mode. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Interrupt based on level sensitivity.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Interrupt based on edge sensitivity.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0EN</name>
							<description>External Interrupt 0 Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable external interrupt 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable external interrupt 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1SEL</name>
							<description>External Interrupt 1 Pin Selection. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT1_0</name>
									<description>Select INT1.0 (PB2.0)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_1</name>
									<description>Select INT1.1 (PB2.1)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_2</name>
									<description>Select INT1.2 (PB2.2)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_3</name>
									<description>Select INT1.3 (PB2.3)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_4</name>
									<description>Select INT1.4 (PB2.4)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_5</name>
									<description>Select INT1.5 (PB2.5)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_6</name>
									<description>Select INT1.6 (PB2.6)</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_7</name>
									<description>Select INT1.7 (PB2.7)</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_8</name>
									<description>Select INT1.8 (PB3.3)</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_9</name>
									<description>Select INT1.9 (PB3.4)</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_10</name>
									<description>Select INT1.10 (PB3.5)</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_11</name>
									<description>Select INT1.11 (PB3.6)</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_12</name>
									<description>Select INT1.12 (PB3.7)</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_13</name>
									<description>Select INT1.13 (PB3.8)</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_14</name>
									<description>Select INT1.14 (PB3.9)</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_15</name>
									<description>Select INT1.15 (PB3.10)</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1POL</name>
							<description>External Interrupt 1 Polarity. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A low value or falling edge on the selected pin will cause interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A high value or rising edge on the selected pin will cause interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1MD</name>
							<description>External Interrupt 1 Mode. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Interrupt based on level sensitivity.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Interrupt based on edge sensitivity.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1EN</name>
							<description>External Interrupt 1 Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable external interrupt 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable external interrupt 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PGTIMER</name>
							<description>Pulse Generator Timer. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>PGDONEF</name>
							<description>Pulse Generator Timer Done Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Firmware has written to the PBPGPHASE register, but the Pulse Generator timer has not expired.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The Pulse Generator cycle finished since the last time PBPGPHASE was written.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL1</name>
					<description>Global Port Control 1</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>JTAGEN</name>
							<description>JTAG Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>JTAG functionality is not pinned out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>JTAG functionality is pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ETMEN</name>
							<description>ETM Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>ETM not pinned out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>ETM is enabled and pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMIFBE0BEN</name>
							<description>EMIF &lt;overline&gt;BE0&lt;/overline&gt; Pin Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EMIF /BE0 pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the /BE0 pin if EMIFEN is also set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMIFCS1EN</name>
							<description>EMIF CS1 Pin Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EMIF CS1 pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the CS1 pin if EMIFEN is also set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMIFEN</name>
							<description>EMIF Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EMIF pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>EMIF is enabled and pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMIFWIDTH</name>
							<description>EMIF Width. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>6</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AWIDTH_8</name>
									<description>EMIF Address[7:0]</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_9</name>
									<description>EMIF Address[8:0], PB2.8 = A[8]</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_10</name>
									<description>EMIF Address[9:0], PB2.7 = A[9]</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_11</name>
									<description>EMIF Address[10:0], PB2.6 = A[10]</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_12</name>
									<description>EMIF Address[11:0], PB2.5 = A[11]</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_13</name>
									<description>EMIF Address[12:0], PB2.4 = A[12]</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_14</name>
									<description>EMIF Address[13:0], PB2.3 = A[13]</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_15</name>
									<description>EMIF Address[14:0], PB2.2 = A[14]</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_16</name>
									<description>EMIF Address[15:0], PB2.1 = A[15]</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_17</name>
									<description>EMIF Address[16:0], PB2.0 = A[16]</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_18</name>
									<description>EMIF Address[17:0], PB1.15 = A[17]</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_19</name>
									<description>EMIF Address[18:0], PB1.14 = A[18]</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_20</name>
									<description>EMIF Address[19:0], PB1.13 = A[19]</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_21</name>
									<description>EMIF Address[20:0], PB1.12 = A[20]</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_22</name>
									<description>EMIF Address[21:0], PB1.11 = A[21]</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_23</name>
									<description>EMIF Address[22:0], PB1.10 = A[22]</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AWIDTH_24</name>
									<description>EMIF Address[23:0], PB1.10 = A[23]</description>
									<value>16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MATMD</name>
							<description>Match Mode. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PINMATCH</name>
									<description>Port Match registers used to provide interrupt / wake sources.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPSENSE_TX</name>
									<description>Port Match registers used to monitor output pin activity for Capacitive Sensing measurements.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPSENSE_RX</name>
									<description>Port Match registers used to monitor input pin activity for Capacitive Sensing measurements.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVREGRMD</name>
							<description>External Regulator Reset Mode. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RESET_ON_ANY</name>
									<description>The pins used by the external regulator will default to digital inputs with weak pull-up enabled on any reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_POR</name>
									<description>The pins used by the external regulator will default to digital inputs with weak pull-up enabled only on Power-On Reset. Their configured mode will be preserved through all other resets.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Port Bank Configuration Lock. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Port Bank Configuration and Control registers are unlocked.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>The following registers are locked from write access: CONTROL1, XBAR0L, XBAR0H, XBAR1, and all PBSKIP registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
