0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SSG_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>SSG_0</groupName>
			<baseAddress>0x4001e000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Pulse Generator Counter. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>SSEL</name>
							<description>Speed Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>The SSG module runs at normal speed, where each pulse and phase cycle consists of 16 ADC clocks.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE</name>
									<description>The SSG module runs at double speed, where each pulse and phase cycle consists of 8 ADC clocks.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHGFREN</name>
							<description>Phase Generator Free-Run Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The Phase Generator runs only when pulse generation occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The Phase Generator runs when an ADC is enabled, regardless of the Pulse Generator settings.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUGFREN</name>
							<description>Pulse Generator Free-Run Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The COUNT field determines the number of pulses generated by the Pulse Generator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The Pulse Generator always generates pulses regardless of COUNT unless all outputs are disabled (EX0EN, EX1EN, EX2EN, and EX3EN are all 0).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EX0INVEN</name>
							<description>Output 0 Invert Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Do not invert the Pulse Generator output on EX0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Invert the Pulse Generator output on EX0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX1INVEN</name>
							<description>Output 1 Invert Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Do not invert the Pulse Generator output on EX1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Invert the Pulse Generator output on EX1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX2INVEN</name>
							<description>Output 2 Invert Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Do not invert the Pulse Generator output on EX2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Invert the Pulse Generator output on EX2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX3INVEN</name>
							<description>Output 3 Invert Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Do not invert the Pulse Generator output on EX3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Invert the Pulse Generator output on EX3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX0EN</name>
							<description>Output 0 Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EX0 Pulse Generator output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EX0 Pulse Generator output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX1EN</name>
							<description>Output 1 Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EX1 Pulse Generator output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EX1 Pulse Generator output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX2EN</name>
							<description>Output 2 Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EX2 Pulse Generator output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EX2 Pulse Generator output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EX3EN</name>
							<description>Output 3 Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EX3 Pulse Generator output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EX3 Pulse Generator output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATUS</name>
							<description>SSG Module Status. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>The SSG module is idle and the Pulse Generator is not operating.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The SSG module is active and the Pulse Generator is counting.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
